//
// This file contains an 'Intel Peripheral Driver' and is
// licensed for Intel CPUs and chipsets under the terms of your
// license agreement with Intel or your vendor.  This file may
// be modified by the user, subject to additional terms of the
// license agreement
//
// *++
//
// Copyright (c) 2016 - 2017 Intel Corporation. All rights reserved
// This software and associated documentation (if any) is furnished
// under a license and may only be used or copied in accordance
// with the terms of the license. Except as permitted by such
// license, no part of this software or documentation may be
// reproduced, stored in a retrieval system, or transmitted in any
// form or by any means without the express written consent of
// Intel Corporation.
//
//
// Module Name:
//
//   FpgaSktSetup.uni
//
// Abstract:
//
//   String definitions for FPGA
//
// Revision History:
//
// --*/

/=#

#langdef   en-US "English"

#string STR_HORIZONTAL_LINE                 #language en-US "--------------------------------------------------"
#string STR_DOUBLE_LINE                     #language en-US "========================================"
#string STR_NULL_STRING                     #language en-US ""


#string STR_FPGA_FORM                       #language en-US "FPGA Configuration"
#string STR_FPGA_FORM_HELP                  #language en-US "Displays and provides option to change the FPGA Settings"

#string STR_AUTO_STRING                     #language en-US "Auto"
#string STR_DISABLED_STRING                 #language en-US "Disable"
#string STR_ENABLED_STRING                  #language en-US "Enable"

#string STR_STANDARD_DEFAULT_PROMPT         #language en-US "Standard Default"
#string STR_MANUFACTURE_DEFAULT_PROMPT      #language en-US "Manufacture Default"

#string STR_SOCKET0_BBS_VERSION_PROMPT      #language en-US "Socket 0 BitStream Version"
#string STR_SOCKET0_BBS_VERSION_VALUE       #language en-US "None"
#string STR_SOCKET1_BBS_VERSION_PROMPT      #language en-US "Socket 1 BitStream Version"
#string STR_SOCKET1_BBS_VERSION_VALUE       #language en-US "None"

#string STR_SOCKET0_BBS_PROMPT              #language en-US "Socket 0 BitStream"
#string STR_SOCKET1_BBS_PROMPT              #language en-US "Socket 1 BitStream"
#string STR_SOCKET_BBS_HELP                 #language en-US "Pick a BitStream to assign to this socket."
#string STR_BBS_AUTO_STRING                 #language en-US "Auto"
#string STR_BBS_NONE_STRING                 #language en-US "None"
#string STR_BBS_HSSI_STRING                 #language en-US "HSSI-BBS"

#string STR_FPGA_THERMAL_MGMT_FORM_TITLE    #language en-US "FPGA Thermal Management"
#string STR_FPGA_THERMAL_MGMT_FORM_HELP     #language en-US "FPGA Thermal Related setting"

#string STR_FPGA_THERMAL_HELP               #language en-US "Select the FPGA Temperature Threshold."
#string STR_FPGA_SOCKET0_TH1                #language en-US "Socket 0 Threshold 1"
#string STR_FPGA_SOCKET0_TH2                #language en-US "Socket 0 Threshold 2"
#string STR_FPGA_SOCKET1_TH1                #language en-US "Socket 1 Threshold 1"
#string STR_FPGA_SOCKET1_TH2                #language en-US "Socket 1 Threshold 2"
#string STR_60_C                            #language en-US "60 C"
#string STR_65_C                            #language en-US "65 C"
#string STR_70_C                            #language en-US "70 C"
#string STR_75_C                            #language en-US "75 C"
#string STR_80_C                            #language en-US "80 C"
#string STR_85_C                            #language en-US "85 C"
#string STR_90_C                            #language en-US "90 C"
#string STR_93_C                            #language en-US "93 C"
#string STR_94_C                            #language en-US "94 C"
#string STR_95_C                            #language en-US "95 C"
#string STR_96_C                            #language en-US "96 C"
#string STR_97_C                            #language en-US "97 C"
#string STR_98_C                            #language en-US "98 C"
#string STR_99_C                            #language en-US "99 C"
#string STR_100_C                           #language en-US "100 C"
#string STR_101_C                           #language en-US "101 C"
#string STR_102_C                           #language en-US "102 C"
#string STR_103_C                           #language en-US "103 C"

#string STR_FPGA_SOCKETE_EN                 #language en-US "Sockets Enable Bitmap(Hex)"
#string STR_FPGA_SOCKETE_EN_HELP            #language en-US "0: Disable all Sockets, 0xFF: Enable all Sockets. "

#string STR_FPGA_DFX_CFG_FORM_TITLE         #language en-US "FPGA DFX Configuration"
#string STR_FPGA_DFX_CFG_FORM_HELP          #language en-US "Enable/Disable FPGA DFX Configuration"

#string STR_HSSI_EQ_TUNING_ENABLE_PROMPT    #language en-US "HSSI EQ Tuning"
#string STR_HSSI_EQ_TUNING_ENABLE_HELP      #language en-US "Enable/Disable FPGA HSSI EQ tuning"
